#+begin_src R :results output :session *R* :exports both
df = read.csv('boaviztapi/data/components/gpu_infos.csv', header=T, skip=1,sep=',')
summary(df)
#+end_src

#+RESULTS:
#+begin_example

    model                TDP        n_cores           process    
 Length:21          Min.   : 30.0   Mode:logical   Min.   : 7.0  
 Class :character   1st Qu.:185.0   NA's:21        1st Qu.:12.0  
 Mode  :character   Median :250.0                  Median :12.0  
                    Mean   :220.7                  Mean   :13.9  
                    3rd Qu.:250.0                  3rd Qu.:16.0  
                    Max.   :400.0                  Max.   :28.0  
                                                   NA's   :1     
 architecture       manufacture_date    die_size         memory    
 Length:21          Min.   :2014     Min.   :2.320   Min.   : 8.0  
 Class :character   1st Qu.:2016     1st Qu.:4.407   1st Qu.:11.0  
 Mode  :character   Median :2018     Median :5.810   Median :12.0  
                    Mean   :2017     Mean   :5.831   Mean   :23.3  
                    3rd Qu.:2018     3rd Qu.:8.150   3rd Qu.:32.0  
                    Max.   :2021     Max.   :8.260   Max.   :80.0  
                    NA's   :1        NA's   :1       NA's   :1     
    source         
 Length:21         
 Class :character  
 Mode  :character

[1] 220.7143

[1] NA
#+end_example


To compute the base impact values for a GPU, we use the results from
\cite{Loubet2023life}.
Results for scenario 2 are given for 6 servers. Each server contains 2
GPUs, each with a die of .81cm².
If we divide the total results for GPUs in scenario 2 by 12 (6
servers * 2 GPu), we obtain impacts per GPU. Then, by removing the
estimated impacts for .81cm² of die, we get some base results.
We also need to convert from Copper equivalent to Antimony
equivalent. to do so, we base ourselves on \cite{van2020abiotic} where
it is shown that one kg of Copper is approximately equivalent in terms of ADP to
0.02 kg of Antimony equivalent.

Since results presented in \cite{Loubet2023life} do not present
Primary energy, we are not able to provide any figure and will
therefore use the base value for CPU.

#+begin_src python :results value :exports both
return 342.80 /12 - 1.97*.81, 10.24152 / 12 * 2E-2 - 5.80E-07*.81
#+end_src

#+RESULTS:
| 26.970966666666666 | 0.0170687302 |

#+begin_src python :results value :exports both
return 1/0.00191
#+end_src

#+RESULTS:
: 523.5602094240837
